var tourarea_arr=[['1','青岛','0'],['2','海滨半岛','1'],['3','泰曲','0'],['4','泰山线路','3'],['5','枣庄','0'],['6','曲阜','3'],['7','台儿庄古城','5'],['8','日照','0'],['9','烟台威海','0'],['10','海岛旅游','9'],['11','华南','0'],['12','海南','11'],['13','桂林','11'],['14','厦门','11'],['15','广东','11'],['16','福建','11'],['17','华东','0'],['18','上海','17'],['19','苏杭','17'],['20','黄山','17'],['21','乌镇','17'],['22','华东五市','17'],['23','华北','0'],['24','北京','23'],['25','大连','23'],['26','天津','23'],['27','内蒙','23'],['28','山西','23'],['29','河北','23'],['30','华中','0'],['31','湖南','30'],['32','庐山','30'],['33','江西','30'],['34','张家界','30'],['35','河南','30'],['36','湖北','30'],['37','三峡','30'],['38','重庆','30'],['39','西南','0'],['40','云南','39'],['41','西藏','39'],['42','九寨','39'],['43','四川','39'],['44','贵州','39'],['45','西北','0'],['46','陕西','45'],['47','新疆','45'],['48','青海','45'],['49','宁夏','45'],['50','甘肃','45'],['51','东北','0'],['52','黑龙江','51'],['53','吉林','51'],['54','辽宁','51'],['55','海岛游','0'],['56','普吉岛','55'],['57','巴厘岛','55'],['58','马尔代夫','55'],['59','沙巴','55'],['60','塞舌尔','55'],['61','帕劳','55'],['62','夏威夷','55'],['63','东南亚','0'],['64','泰国','63'],['65','巴厘岛','63'],['66','巴厘岛','63'],['67','新加坡','63'],['68','马来西亚','63'],['69','菲律宾','63'],['70','越南','63'],['71','柬埔寨','63'],['72','欧洲','0'],['73','英国','72'],['74','法国','72'],['75','希腊','72'],['76','意大利','72'],['77','西班牙','72'],['78','俄罗斯','72'],['79','德国','72'],['80','葡萄牙','72'],['81','瑞士','72'],['82','梵蒂冈','72'],['83','马耳他','72'],['84','爱尔兰','72'],['85','荷兰','72'],['86','比利时','72'],['87','卢森堡','72'],['88','芬兰','72'],['89','瑞典','72'],['90','挪威','72'],['91','冰岛','72'],['92','奥地利','72'],['93','匈牙利','72'],['94','斯洛伐克捷克','72'],['95','爱沙尼亚','72'],['96','丹麦','72'],['97','列支敦士登','72'],['98','美洲','0'],['99','美国','98'],['100','加拿大','98'],['101','巴西','98'],['102','墨西哥','98'],['103','非洲','0'],['104','南非','103'],['105','埃及','103'],['106','澳洲','0'],['107','澳大利亚','106'],['108','新西兰','106'],['109','港奥台','0'],['110','香港','109'],['111','澳门','109'],['112','台湾','109']];
function GetTourAreaFirst(cid,sepStr){
    var retValue,i,sele;
    for (var i=0;i<tourarea_arr.length;i++){
        if(tourarea_arr[i][2]==0){	
            if(parseInt(tourarea_arr[i][0])==parseInt(cid)){	
	            sele=' selected';
            }else{
	            sele='';
            }
            retValue+='<option value="'+tourarea_arr[i][0]+'"'+sele+'>'+sepStr+tourarea_arr[i][1]+'</option>';	
        }	
    }
    return retValue;
}
function GetTourChilds(pid,cid,did){
    var retValue,i,sele;
    var childs=document.getElementById(did);
    childs.length=0;
        if(pid==0) childs.options[0]=new Option('...',0);;
    for (var i=0;i<tourarea_arr.length;i++){
        if(parseInt(tourarea_arr[i][2])==parseInt(pid)){
            var ofs=childs.length;
            childs.options[ofs]=new Option(tourarea_arr[i][1],tourarea_arr[i][0]);	
            if(parseInt(cid)==parseInt(tourarea_arr[i][0])){
	            childs.options[ofs].selected=true;
            }
        }
    }
}
